Model:
Model: "sequential_1"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 128)                                     4096              
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 256)                                     33024             
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     62451             
========================================================================================================================
Total params: 99,571
Trainable params: 99,571
Non-trainable params: 0
________________________________________________________________________________________________________________________
