Local Actor:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 91)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 128)                                     11776             
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 128)                                     512               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 128)                                     0                 
________________________________________________________________________________________________________________________
actor_dense_layer_2 (Dense)                           (None, 64)                                      8256              
________________________________________________________________________________________________________________________
actor_batch_normalization_2 (BatchNormalization)      (None, 64)                                      256               
________________________________________________________________________________________________________________________
actor_activation_2 (Activation)                       (None, 64)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_3 (Dense)                           (None, 32)                                      2080              
________________________________________________________________________________________________________________________
actor_batch_normalization_3 (BatchNormalization)      (None, 32)                                      128               
________________________________________________________________________________________________________________________
actor_activation_3 (Activation)                       (None, 32)                                      0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     8019              
========================================================================================================================
Total params: 31,027
Trainable params: 30,579
Non-trainable params: 448
________________________________________________________________________________________________________________________



Local Critic:
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 91)                 0                                                     
________________________________________________________________________________________________________________________
critic_dense_layer_1 (Dense)           (None, 128)                11776         critic_input_states[0][0]               
________________________________________________________________________________________________________________________
critic_batch_normalization_1 (BatchNor (None, 128)                512           critic_dense_layer_1[0][0]              
________________________________________________________________________________________________________________________
critic_activation_1 (Activation)       (None, 128)                0             critic_batch_normalization_1[0][0]      
________________________________________________________________________________________________________________________
critic_dense_layer_2 (Dense)           (None, 64)                 8256          critic_activation_1[0][0]               
________________________________________________________________________________________________________________________
critic_batch_normalization_2 (BatchNor (None, 64)                 256           critic_dense_layer_2[0][0]              
________________________________________________________________________________________________________________________
critic_activation_2 (Activation)       (None, 64)                 0             critic_batch_normalization_2[0][0]      
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_3 (Dense)           (None, 32)                 2080          critic_activation_2[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 32)                 7808          critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 32)                 0             states_dense_layer_3[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 32)                 0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  33            critic_activation[0][0]                 
========================================================================================================================
Total params: 30,721
Trainable params: 30,337
Non-trainable params: 384
________________________________________________________________________________________________________________________



Target Actor:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 91)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 128)                                     11776             
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 128)                                     512               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 128)                                     0                 
________________________________________________________________________________________________________________________
actor_dense_layer_2 (Dense)                           (None, 64)                                      8256              
________________________________________________________________________________________________________________________
actor_batch_normalization_2 (BatchNormalization)      (None, 64)                                      256               
________________________________________________________________________________________________________________________
actor_activation_2 (Activation)                       (None, 64)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_3 (Dense)                           (None, 32)                                      2080              
________________________________________________________________________________________________________________________
actor_batch_normalization_3 (BatchNormalization)      (None, 32)                                      128               
________________________________________________________________________________________________________________________
actor_activation_3 (Activation)                       (None, 32)                                      0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     8019              
========================================================================================================================
Total params: 31,027
Trainable params: 30,579
Non-trainable params: 448
________________________________________________________________________________________________________________________



Target Critic:
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 91)                 0                                                     
________________________________________________________________________________________________________________________
critic_dense_layer_1 (Dense)           (None, 128)                11776         critic_input_states[0][0]               
________________________________________________________________________________________________________________________
critic_batch_normalization_1 (BatchNor (None, 128)                512           critic_dense_layer_1[0][0]              
________________________________________________________________________________________________________________________
critic_activation_1 (Activation)       (None, 128)                0             critic_batch_normalization_1[0][0]      
________________________________________________________________________________________________________________________
critic_dense_layer_2 (Dense)           (None, 64)                 8256          critic_activation_1[0][0]               
________________________________________________________________________________________________________________________
critic_batch_normalization_2 (BatchNor (None, 64)                 256           critic_dense_layer_2[0][0]              
________________________________________________________________________________________________________________________
critic_activation_2 (Activation)       (None, 64)                 0             critic_batch_normalization_2[0][0]      
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_3 (Dense)           (None, 32)                 2080          critic_activation_2[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 32)                 7808          critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 32)                 0             states_dense_layer_3[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 32)                 0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  33            critic_activation[0][0]                 
========================================================================================================================
Total params: 30,721
Trainable params: 30,337
Non-trainable params: 384
________________________________________________________________________________________________________________________
