Model:
Model: "sequential_1"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 128)                                     4096              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     31347             
========================================================================================================================
Total params: 35,443
Trainable params: 35,443
Non-trainable params: 0
________________________________________________________________________________________________________________________
