Model:
Model: "sequential_1"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 24, 16)                                  144               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 24, 16)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 4, 16)                                   0                 
________________________________________________________________________________________________________________________
flatten_1 (Flatten)                                   (None, 64)                                      0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 128)                                     8320              
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 64)                                      8256              
________________________________________________________________________________________________________________________
layer_2 (Dense)                                       (None, 32)                                      2080              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     8019              
========================================================================================================================
Total params: 26,819
Trainable params: 26,819
Non-trainable params: 0
________________________________________________________________________________________________________________________
