Local Actor:
Model: "actor"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 31)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 128)                                     4096              
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 128)                                     512               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 128)                                     0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     31347             
========================================================================================================================
Total params: 35,955
Trainable params: 35,699
Non-trainable params: 256
________________________________________________________________________________________________________________________



Local Critic:
Model: "critic_model"
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 31)                 0                                                     
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_1 (Dense)           (None, 128)                4096          critic_input_states[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 128)                31232         critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 128)                0             states_dense_layer_1[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 128)                0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  129           critic_activation[0][0]                 
========================================================================================================================
Total params: 35,457
Trainable params: 35,457
Non-trainable params: 0
________________________________________________________________________________________________________________________



Target Actor:
Model: "actor"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 31)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 128)                                     4096              
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 128)                                     512               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 128)                                     0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     31347             
========================================================================================================================
Total params: 35,955
Trainable params: 35,699
Non-trainable params: 256
________________________________________________________________________________________________________________________



Target Critic:
Model: "critic_model"
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 31)                 0                                                     
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_1 (Dense)           (None, 128)                4096          critic_input_states[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 128)                31232         critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 128)                0             states_dense_layer_1[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 128)                0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  129           critic_activation[0][0]                 
========================================================================================================================
Total params: 35,457
Trainable params: 35,457
Non-trainable params: 0
________________________________________________________________________________________________________________________
