Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 84, 16)                                  144               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 84, 16)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 16, 16)                                  0                 
________________________________________________________________________________________________________________________
flatten_1 (Flatten)                                   (None, 256)                                     0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 128)                                     32896             
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 192)                                     24768             
________________________________________________________________________________________________________________________
layer_2 (Dense)                                       (None, 256)                                     49408             
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     62451             
========================================================================================================================
Total params: 169,667
Trainable params: 169,667
Non-trainable params: 0
________________________________________________________________________________________________________________________
