Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 128)                                     11776             
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 64)                                      8256              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     15795             
========================================================================================================================
Total params: 35,827
Trainable params: 35,827
Non-trainable params: 0
________________________________________________________________________________________________________________________
