Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 128)                                     11776             
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     31347             
========================================================================================================================
Total params: 43,123
Trainable params: 43,123
Non-trainable params: 0
________________________________________________________________________________________________________________________
