Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 84, 16)                                  144               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 84, 16)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 16, 16)                                  0                 
________________________________________________________________________________________________________________________
flatten_110 (Flatten)                                 (None, 256)                                     0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 32)                                      8224              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     8019              
========================================================================================================================
Total params: 16,387
Trainable params: 16,387
Non-trainable params: 0
________________________________________________________________________________________________________________________
