Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 32)                                      2944              
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 16)                                      528               
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     4131              
========================================================================================================================
Total params: 7,603
Trainable params: 7,603
Non-trainable params: 0
________________________________________________________________________________________________________________________
