Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 84, 32)                                  288               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 84, 32)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 16, 32)                                  0                 
________________________________________________________________________________________________________________________
flatten_1 (Flatten)                                   (None, 512)                                     0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 128)                                     65664             
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 64)                                      8256              
________________________________________________________________________________________________________________________
layer_2 (Dense)                                       (None, 32)                                      2080              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     8019              
========================================================================================================================
Total params: 84,307
Trainable params: 84,307
Non-trainable params: 0
________________________________________________________________________________________________________________________
