Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 128)                                     4096              
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 192)                                     24768             
________________________________________________________________________________________________________________________
layer_2 (Dense)                                       (None, 256)                                     49408             
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     62451             
========================================================================================================================
Total params: 140,723
Trainable params: 140,723
Non-trainable params: 0
________________________________________________________________________________________________________________________
