Local Actor:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 91)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 128)                                     11776             
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 128)                                     512               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 128)                                     0                 
________________________________________________________________________________________________________________________
actor_dense_layer_2 (Dense)                           (None, 256)                                     33024             
________________________________________________________________________________________________________________________
actor_batch_normalization_2 (BatchNormalization)      (None, 256)                                     1024              
________________________________________________________________________________________________________________________
actor_activation_2 (Activation)                       (None, 256)                                     0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     62451             
========================================================================================================================
Total params: 108,787
Trainable params: 108,019
Non-trainable params: 768
________________________________________________________________________________________________________________________



Local Critic:
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 91)                 0                                                     
________________________________________________________________________________________________________________________
critic_dense_layer_1 (Dense)           (None, 128)                11776         critic_input_states[0][0]               
________________________________________________________________________________________________________________________
critic_batch_normalization_1 (BatchNor (None, 128)                512           critic_dense_layer_1[0][0]              
________________________________________________________________________________________________________________________
critic_activation_1 (Activation)       (None, 128)                0             critic_batch_normalization_1[0][0]      
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_2 (Dense)           (None, 256)                33024         critic_activation_1[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 256)                62464         critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 256)                0             states_dense_layer_2[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 256)                0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  257           critic_activation[0][0]                 
========================================================================================================================
Total params: 108,033
Trainable params: 107,777
Non-trainable params: 256
________________________________________________________________________________________________________________________



Target Actor:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 91)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 128)                                     11776             
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 128)                                     512               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 128)                                     0                 
________________________________________________________________________________________________________________________
actor_dense_layer_2 (Dense)                           (None, 256)                                     33024             
________________________________________________________________________________________________________________________
actor_batch_normalization_2 (BatchNormalization)      (None, 256)                                     1024              
________________________________________________________________________________________________________________________
actor_activation_2 (Activation)                       (None, 256)                                     0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     62451             
========================================================================================================================
Total params: 108,787
Trainable params: 108,019
Non-trainable params: 768
________________________________________________________________________________________________________________________



Target Critic:
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 91)                 0                                                     
________________________________________________________________________________________________________________________
critic_dense_layer_1 (Dense)           (None, 128)                11776         critic_input_states[0][0]               
________________________________________________________________________________________________________________________
critic_batch_normalization_1 (BatchNor (None, 128)                512           critic_dense_layer_1[0][0]              
________________________________________________________________________________________________________________________
critic_activation_1 (Activation)       (None, 128)                0             critic_batch_normalization_1[0][0]      
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_2 (Dense)           (None, 256)                33024         critic_activation_1[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 256)                62464         critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 256)                0             states_dense_layer_2[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 256)                0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  257           critic_activation[0][0]                 
========================================================================================================================
Total params: 108,033
Trainable params: 107,777
Non-trainable params: 256
________________________________________________________________________________________________________________________
