Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 64)                                      5888              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     15795             
========================================================================================================================
Total params: 21,683
Trainable params: 21,683
Non-trainable params: 0
________________________________________________________________________________________________________________________
