Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 32)                                      2944              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     8019              
========================================================================================================================
Total params: 10,963
Trainable params: 10,963
Non-trainable params: 0
________________________________________________________________________________________________________________________
