Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 84, 16)                                  144               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 84, 16)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 16, 16)                                  0                 
________________________________________________________________________________________________________________________
flatten_62 (Flatten)                                  (None, 256)                                     0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 64)                                      16448             
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 32)                                      2080              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     8019              
========================================================================================================================
Total params: 26,691
Trainable params: 26,691
Non-trainable params: 0
________________________________________________________________________________________________________________________
