Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 84, 32)                                  288               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 84, 32)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 16, 32)                                  0                 
________________________________________________________________________________________________________________________
flatten_1 (Flatten)                                   (None, 512)                                     0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 64)                                      32832             
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     15795             
========================================================================================================================
Total params: 48,915
Trainable params: 48,915
Non-trainable params: 0
________________________________________________________________________________________________________________________
