Model:
Model: "sequential_1"
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
input (Dense)                                         (None, 64)                                      5888              
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 32)                                      2080              
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     8019              
========================================================================================================================
Total params: 15,987
Trainable params: 15,987
Non-trainable params: 0
________________________________________________________________________________________________________________________
