Model:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
conv_input (Conv1D)                                   (None, 24, 16)                                  144               
________________________________________________________________________________________________________________________
activation (Activation)                               (None, 24, 16)                                  0                 
________________________________________________________________________________________________________________________
max_pooling (MaxPooling1D)                            (None, 4, 16)                                   0                 
________________________________________________________________________________________________________________________
flatten_34 (Flatten)                                  (None, 64)                                      0                 
________________________________________________________________________________________________________________________
hidden_in (Dense)                                     (None, 128)                                     8320              
________________________________________________________________________________________________________________________
layer_1 (Dense)                                       (None, 256)                                     33024             
________________________________________________________________________________________________________________________
output (Dense)                                        (None, 243)                                     62451             
========================================================================================================================
Total params: 103,939
Trainable params: 103,939
Non-trainable params: 0
________________________________________________________________________________________________________________________
