Local Actor:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 91)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 64)                                      5888              
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 64)                                      256               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 64)                                      0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     15795             
========================================================================================================================
Total params: 21,939
Trainable params: 21,811
Non-trainable params: 128
________________________________________________________________________________________________________________________



Local Critic:
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 91)                 0                                                     
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_1 (Dense)           (None, 64)                 5888          critic_input_states[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 64)                 15616         critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 64)                 0             states_dense_layer_1[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 64)                 0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  65            critic_activation[0][0]                 
========================================================================================================================
Total params: 21,569
Trainable params: 21,569
Non-trainable params: 0
________________________________________________________________________________________________________________________



Target Actor:
________________________________________________________________________________________________________________________
Layer (type)                                          Output Shape                                    Param #           
========================================================================================================================
actor_input_states (InputLayer)                       (None, 91)                                      0                 
________________________________________________________________________________________________________________________
actor_dense_layer_1 (Dense)                           (None, 64)                                      5888              
________________________________________________________________________________________________________________________
actor_batch_normalization_1 (BatchNormalization)      (None, 64)                                      256               
________________________________________________________________________________________________________________________
actor_activation_1 (Activation)                       (None, 64)                                      0                 
________________________________________________________________________________________________________________________
actor_actions (Dense)                                 (None, 243)                                     15795             
========================================================================================================================
Total params: 21,939
Trainable params: 21,811
Non-trainable params: 128
________________________________________________________________________________________________________________________



Target Critic:
________________________________________________________________________________________________________________________
Layer (type)                           Output Shape               Param #       Connected to                            
========================================================================================================================
critic_input_states (InputLayer)       (None, 91)                 0                                                     
________________________________________________________________________________________________________________________
critic_input_actions (InputLayer)      (None, 243)                0                                                     
________________________________________________________________________________________________________________________
states_dense_layer_1 (Dense)           (None, 64)                 5888          critic_input_states[0][0]               
________________________________________________________________________________________________________________________
actions_dense_layer_1 (Dense)          (None, 64)                 15616         critic_input_actions[0][0]              
________________________________________________________________________________________________________________________
critic_add (Add)                       (None, 64)                 0             states_dense_layer_1[0][0]              
                                                                                actions_dense_layer_1[0][0]             
________________________________________________________________________________________________________________________
critic_activation (Activation)         (None, 64)                 0             critic_add[0][0]                        
________________________________________________________________________________________________________________________
q_values (Dense)                       (None, 1)                  65            critic_activation[0][0]                 
========================================================================================================================
Total params: 21,569
Trainable params: 21,569
Non-trainable params: 0
________________________________________________________________________________________________________________________
